04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/heatExchanger/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Create meshes
runApplication -s air    blockMesh -region air
runApplication -s porous blockMesh -region porous

# Create rotor blades in air region
runApplication -s air.1 createZones -region air -dict createZonesDict.1

runApplication createBaffles -region air

# Create rotor zone in air region for MRF
runApplication -s air.2 createZones -region air -dict createZonesDict.2

#------------------------------------------------------------------------------
